content/posts/roguelike-tutorial-part6.md
+++
title = "Roguelike tutorial for Common Lisp - Part 6 - Combat"
author = ["Nick Forrer"]
tags = ["roguelike", "gamedev", "lisp", "tutorial"]
categories = ["tutorials", "roguelike-tutorial"]
draft = true
+++

This tutorial series is based on the [Python Roguelike Tutorial](http://rogueliketutorials.com). This will be
covering [Part 6](http://rogueliketutorials.com/tutorials/tcod/part-6/) of that tutorial.

In this part, we will be adding a combat system, allowing players to kill monsters,
as well as be killed. To accomplish this, we will also be adding a component
system, and implementing an A\* pathfinding algorithm. This will be a
relatively long post, so let's get right into it.


## Components {#components}

For any enemies that can fight and take damage, we'll be creating a fighter
"component," which will contain the entities hp, attack, and defense. This is
known as "composition," rather than inheritance. In an inheritance model, we
would likely have created a new Fighter class that inherits from the Entity
class. These types of hierarchies can start out fine, but will quickly become
difficult to work with.

Create a new file, components.lisp, with the new component and fighter classes:

```lisp
(in-package :cl-rltut)

(defclass component ()
  ((owner :initarg :owner :accessor component/owner)))

(defclass fighter (component)
  ((max-hp :initarg :max-hp :accessor fighter/max-hp :initform nil)
   (hp :initarg :hp :accessor fighter/hp)
   (defense :initarg :defense :accessor fighter/defense)
   (power :initarg :power :accessor fighter/power)))
```

We'll also be creating a component to represent an enemies AI behavior, along
with a "take-turn" method to execute the behavior:

```lisp
(defclass basic-monster (component) ())

(defgeneric take-turn (component))

(defmethod take-turn ((component basic-monster))
  (format t "The ~A wonders when it will get to move." (component/owner component)))
```

New we need to add slots to the "entity" class to hold the two new components.
They will be optional, since not all entities will have the components. We'll
also need to set the "owner" slot on the components to the entity that they are
being attached to, so that the components can get information for their entity,
such as the entity position.

{{< highlight lisp "linenos=table, linenostart=1, hl_lines=8-9  11-17" >}}
(defclass entity ()
  ((name :initarg :name :accessor entity/name)
   (x :initarg :x :accessor entity/x)
   (y :initarg :y :accessor entity/y)
   (char :initarg :char :accessor entity/char)
   (color :initarg :color :accessor entity/color)
   (blocks :initarg :blocks :accessor entity/blocks)
   (fighter :initarg :fighter :accessor entity/fighter :initform nil)
   (ai :initarg :ai :accessor entity/ai :initform nil)))

(defmethod initialize-instance :after ((entity entity) &rest initargs)
  (declare (ignore initargs))
  (with-slots (fighter ai) entity
    (when fighter
      (setf (component/owner fighter) entity))
    (when ai
      (setf (component/owner ai) entity))))
{{< /highlight >}}

Now, when creating the player entity, we'll want to create a fighter component
to add (in the main function in cl-rltut.lisp):

{{< highlight lisp "linenos=table, linenostart=1, hl_lines=2-5 13" >}}
...
(let* ((fighter-component (make-instance 'fighter
                                         :hp 30
                                         :defense 2
                                         :power 5))
       (player (make-instance 'entity
                              :name "Player"
                              :x (/ *screen-width* 2)
                              :y (/ *screen-height* 2)
                              :char #\@
                              :color (blt:white)
                              :blocks t
                              :fighter fighter-component))
       (entities (list player))
       (map (make-instance 'game-map :w *map-width* :h *map-height*)))
  ...)
{{< /highlight >}}

And we'll do the same for the monsters (in the place-entities function in
game-map.lisp):

{{< highlight lisp "linenos=table, linenostart=1, hl_lines=8-9 11 14-15 17" >}}
(defmethod place-entities ((map game-map) (room rect) entities max-enemies-per-room)
  (let ((num-monsters (random max-enemies-per-room)))
    (dotimes (monster-index num-monsters)
      (let ((x (+ (random (round (/ (- (rect/x2 room) (rect/x1 room) 1) 2))) (1+ (rect/x1 room))))
            (y (+ (random (round (/ (- (rect/y2 room) (rect/y1 room) 1) 2))) (1+ (rect/y1 room)))))
        (unless (entity-at entities x y)
          (cond ((< (random 100) 80)
                 (let* ((fighter-component (make-instance 'fighter :hp 10 :defense 0 :power 3))
                        (ai-component (make-instance 'basic-monster))
                        (orc (make-instance 'entity :name "Orc" :x x :y y :color (blt:green) :char #\o :blocks t
                                                    :fighter fighter-component :ai ai-component)))
                   (nconc entities (list orc))))
                (t
                 (let* ((fighter-component (make-instance 'fighter :hp 16 :defense 1 :power 4))
                        (ai-component (make-instance 'basic-monster))
                        (troll (make-instance 'entity :name "Troll" :x x :y y :color (blt:yellow) :char #\T :blocks t
                                                      :fighter fighter-component :ai ai-component)))
                   (nconc entities (list troll))))))))))
{{< /highlight >}}

Now we can update the game loop to call the take-turn function on all the
entities with the AI component:

{{< highlight lisp "linenos=table, linenostart=1" >}}
(when (eql (game-state/state game-state) :enemy-turn)
  (dolist (entity (remove-if-not #'entity/ai entities))
    (take-turn (entity/ai entity)))
  (setf (game-state/state game-state) :player-turn))
{{< /highlight >}}

You can now run the game again. The only difference you'll see is the message
being printed out by the monsters is different, but we've set up a working
component system. Next we'll want to update the AI component to move towards the
player and attack.
