content/posts/roguelike-tutorial-part6.md


## Basic monster AI {#basic-monster-ai}

Add a "move-towards" method to the entity class, which will move an the entity
towards a target location. It will only move in a straight line towards the
target, and stop if it hits a wall. We'll add pathfinding a little later.

```lisp
(defgeneric move-towards (e target-x target-y map entities))

(defmethod move-towards ((e entity) target-x target-y map entities)
  (with-slots (x y) e
    (let* ((dx (- target-x x))
           (dy (- target-y y))
           (distance (sqrt (+ (expt dx 2) (expt dy 2)))))
      (setf dx (round (/ dx distance))
            dy (round (/ dy distance)))
      (unless (or (blocked-p map (+ x dx) (+ y dy))
                  (blocking-entity-at entities (+ x dx) (+ y dy)))
        (move e dx dy)))))
```

Also add a "distance-to" method, which we'll use to decide whether a monster is
close enough to attack the player:

```lisp
(defmethod distance-to ((e entity) (other entity))
  (let ((dx (- (entity/x other) (entity/x e)))
        (dy (- (entity/y other) (entity/y e))))
    (sqrt (+ (expt dx 2) (expt dy 2)))))
```

Now update the "take-turn" method to move towards the player. We'll move the
monster as long as it's within the FOV of the player. If the monster is one tile
away from the player, then print out an attack message.

```lisp
(defgeneric take-turn (component target map entities))

(defmethod take-turn ((component basic-monster) target map entities)
  (let* ((monster (component/owner component))
         (in-sight (tile/visible (aref (game-map/tiles map) (entity/x monster) (entity/y monster)))))
    (when in-sight
      (cond ((>= (distance-to monster target) 2)
             (move-towards monster (entity/x target) (entity/y target) map entities))
            ((> (fighter/hp (entity/fighter target)) 0)
             (format t "The ~A insults you! Your ego is damaged!" (entity/name monster)))))))
```

We'll also need to update the call to "take-turn" to pass in the target, map,
and entities parameters.

```lisp
(when (eql (game-state/state game-state) :enemy-turn)
  (dolist (entity (remove-if-not #'entity/ai entities))
    (take-turn (entity/ai entity) player map entities))
  (setf (game-state/state game-state) :player-turn))
```

Now you can run the game, and the enemies will chase you. When they get close
enough they'll print out a message insulting you.

Currently, the monsters are able to attack the player from a diagonal position,
but the player can only attack up/down/left/right, and both the player and
monsters can only move in four directions. We can either stop the monsters from
attacking diagonally, or allow all entities to attack and move in eight
directions. We'll implement the latter. First, let's allow the player to move in
eight directions. We'll use the "vim keys" for movement. Update the
"handle-keys" function as follows:

{{< highlight lisp "linenos=table, linenostart=1" >}}
(defun handle-keys ()
  (when (blt:has-input-p)
    (blt:key-case (blt:read)
                  ((or :up :k) (list :move (cons 0 -1)))
                  ((or :down :j) (list :move (cons 0 1)))
                  ((or :left :h) (list :move (cons -1 0)))
                  ((or :right :l) (list :move (cons 1 0)))
                  (:y (list :move (cons -1 -1)))
                  (:u (list :move (cons 1 -1)))
                  (:b (list :move (cons -1 1)))
                  (:n (list :move (cons 1 1)))
                  (:escape (list :quit t))
                  (:close (list :quit t)))))
{{< /highlight >}}
