content-org/blog_posts.org
*** A-star Pathfinding
Now, we'll want to allow the enemies to move in eight directions. To do this,
we'll need to implement a pathfinding algorithm called "A* (A-star)." Red Blob Games
as a great [[https://www.redblobgames.com/pathfinding/a-star/introduction.html][introduction to A*]], as well as an [[https://www.redblobgames.com/pathfinding/a-star/implementation.html][implementation guide]] for
Python, C++, and C#. For my implementation, I used [[https://medium.com/@nicholas.w.swift/easy-a-star-pathfinding-7e6689c7f7b2][this article]] as a guide. I
won't be going very in-depth of how the algorithm works at a high level, so
please refer to the those articles for more information.

First, we're going to use a new library to make use of a priority queue. Update the
dependencies in your ASDF file to match the following:
#+BEGIN_SRC lisp
:depends-on (#:cl-blt #:queues.priority-queue)
#+END_SRC

If you have you're REPl open, go ahead and load the system with Quicklisp:
#+BEGIN_SRC lisp
(ql:quickload :queues.priority-queue)
#+END_SRC

Create a new file "pathfinding.lisp". We'll start by creating a "node" class to
hold the position of the tile, the "parent" (node that we came from to get to
this node), and the g/h/f variables used in the A* algorithm.

- "h" is the estimated distance from the current node to the target location. We
  just calculate the distance between the positions using the Pythagorean
  Theorem, but other estimations could be used instead.
- "g" is the distance from the starting node to the current node. To calculate
  this, we've decided moving left/right/up/down counts as a distance of 10, and
  moving diagonally counts as 14. The "g" for a given node is the sum of all the
  "g" values of the previous nodes it took to get to the current node.
- "f" is the total cost of the node. It's the sum of the "g" and "h" values.

We'll also include some helper functions for the class as well.
=*all-directions*= stores the directions the path can follow from a given tile,
which is in all eight directions.

#+BEGIN_SRC lisp
(in-package #:cl-rltut)

(defparameter *all-directions*
  (list (cons 0 -1)
        (cons 0 1)
        (cons -1 0)
        (cons 1 0)
        (cons -1 -1)
        (cons -1 1)
        (cons 1 -1)
        (cons 1 1)))

(defclass node ()
  ((g :initform 0 :accessor node/g)
   (h :initform 0 :accessor node/h)
   (f :initform 0 :accessor node/f)
   (distance-from-parent :initarg :distance-from-parent :accessor node/distance-from-parent)
   (parent :initarg :parent :initform nil :accessor node/parent)
   (position :initarg :position :initform nil :accessor node/position)))

(defmethod print-object ((obj node) stream)
  (print-unreadable-object (obj stream :type t)
    (with-slots (position parent) obj
      (format stream "~A, parent ~A" position parent))))

(defun node-equal (n1 n2)
  "The two nodes are equal if their position slots are equal."
  (equal (node/position n1) (node/position n2)))

(defun node-compare (n1 n2)
  "Compares the F slots on the node, and returns true if n1's F slot is less than n2's."
  (< (node/f n1) (node/f n2)))

(defun find-in-queue (queue n)
  "Finds the node N in the QUEUE by it's position. If there are multiple nodes
with the same position, it will return the last one it finds."
  (let ((node nil))
    (queues:map-queue #'(lambda (item)
                          (when (node-equal n item)
                            (setf node item)))
                      queue)
    node))
#+END_SRC

Next, we'll write some helper functions to support the A* algorithm. The
documentation on the functions should describe their functionality.

#+BEGIN_SRC lisp
(defun create-path (current-node)
  "Given a node, return a list of all parent nodes leading to it."
  (do ((path nil)
       (current current-node (node/parent current)))
      ((null current) (reverse path))
    (setf path (append path (list (node/position current))))))

(defun make-node (parent-node node-x node-y direction-from-parent)
  "Creates a NODE instance with the given PARENT, NODE-X and NODE-Y, and calculates the
DISTANCE-FROM-PARENT."
  (let ((distance 10))
    (if (and (not (zerop (car direction-from-parent)))
             (not (zerop (cdr direction-from-parent))))
        (setf distance 14))
    (make-instance 'node :parent parent-node
                         :position (cons node-x node-y)
                         :distance-from-parent distance)))

(defun generate-node-cost (child current-node end-node)
  "Calculates and sets the G, H, and F slots on child."
  (with-slots (g h f position distance-from-parent) child
    (setf g (+ distance-from-parent (node/g current-node))
          h (+ (expt (- (car position) (car (node/position end-node))) 2)
               (expt (- (cdr position) (cdr (node/position end-node))) 2))
          f (+ g h))))

(defun update-open-queue (open-list child-node)
  "Updates an existing entry in OPEN-LIST if one exists that both matches CHILD-NODE, and
has a larger G value. If there is no existing entry matching CHILD-NODE, then if pushes
CHILD-NODE onto OPEN-LIST."
  (let ((existing-child (find-in-queue open-list child-node)))
    (cond ((and existing-child (< (node/g child-node) (node/g existing-child)))
           (queues:queue-change open-list
                                (queues:queue-find open-list existing-child)
                                child-node))
          (t
           (queues:qpush open-list child-node)))))

(defun generate-node-children (current-node map open-list closed-list end-node)
  "Generates a list of all valid nodes that can be moved to from CURRENT-NODE,
and adds them to OPEN-QUEUE. A valid node is one that is within the MAP dimensions,
the tile is not blocking, and the node is not on CLOSED-LIST."
  (dolist (new-position *all-directions*)
    (let ((node-x (+ (car (node/position current-node))
                     (car new-position)))
          (node-y (+ (cdr (node/position current-node))
                     (cdr new-position))))
      (unless (or (> node-x (1- (game-map/w map)))
                  (< node-x 0)
                  (> node-y (1- (game-map/h map)))
                  (< node-y 0))
        (unless (tile/blocked (aref (game-map/tiles map) node-x node-y))
          (let ((child (make-node current-node node-x node-y new-position)))
            ;; child is on the closed list
            (unless (find child closed-list :test 'node-equal)
              (generate-node-cost child current-node end-node)
              (update-open-queue open-list child))))))))
#+END_SRC

Now we can write the main function of the algorithm, =astar=. It will start by
creating node instances for the start and end nodes, as well as the open-list
and closed-list. The open-list is initially populated with the start-node as the
first node to check. It will then begin a =do= loop, which pops the next node
off of the open-list queue to process, and continues looping until the path to
the end-node is found, or the open-list queue is empty. The function will return
a list of positions representing the path from start-node to end-node.

#+BEGIN_SRC lisp
(defun astar (map start end)
  "Returns a list of cons cells as a path from the given start to the given end in the given map."
  (let ((start-node (make-instance 'node :position start))
        (end-node (make-instance 'node :position end))
        (open-list (queues:make-queue :priority-queue :compare #'node-compare))
        (closed-list nil))
    (queues:qpush open-list start-node)
    (do ((current-node (queues:qpop open-list) (queues:qpop open-list)))
        ((null current-node))
      (setf closed-list (append closed-list (list current-node)))

      ;; found the goal
      (when (node-equal current-node end-node)
        (return-from astar (create-path current-node)))

      (generate-node-children current-node map open-list closed-list end-node))))
#+END_SRC

To make use of this function, modify the =move-towards= method in entity.lisp
to call =astar= and move to the second position in the returned path (remember
the first position in the path is where the entity is currently at):
#+BEGIN_SRC lisp
(defmethod move-towards ((e entity) target-x target-y map entities)
  (with-slots (x y) e
    (let ((path (astar map (cons x y) (cons target-x target-y))))
      (when path
        (let ((next-location (nth 1 path)))
          (unless (blocking-entity-at entities (car next-location) (cdr next-location))
            (move e (- (car next-location) x) (- (cdr next-location) y))))))))
#+END_SRC

Now if you run the game, you'll see the enemy monsters following the player
around, and that they can now move diagonally.

