content-org/blog_posts.org
*** Combat
Next we'll start to implement the cambat system. First, add a =take-damage=
method to the =fighter= class:
#+BEGIN_SRC lisp
(defgeneric take-damage (component amount))

(defmethod take-damage ((component fighter) amount)
  (decf (fighter/hp component) amount))
#+END_SRC

Also add an =attack= method to the =fighter= class. It calculate the damage of
the attack by subtracting the defenders defense value from the attackers power.
If the damage is above zero, then it'll call the =take-damage= function on the defender.
#+BEGIN_SRC lisp
(defgeneric attack (component target))

(defmethod attack ((component fighter) (target entity))
  (let ((damage (- (fighter/power component) (fighter/defense (entity/fighter target)))))
    (cond
      ((> damage 0)
       (take-damage (entity/fighter target) damage))
       (format t "~A attacks ~A for ~A hit points.~%"
               (entity/name (component/owner component))
               (entity/name target)
               damage)
      (t
       (format t "~A attacks ~A but does no damage.~%"
               (entity/name (component/owner component))
               (entity/name target))))))
#+END_SRC

We can now replace the placeholder messages that we were printing before. In the
cl-rltut.lisp files game loop:
#+BEGIN_SRC lisp -n :hl_lines 5
...
(unless (blocked-p map destination-x destination-y)
  (let ((target (blocking-entity-at entities destination-x destination-y)))
    (cond (target
           (attack (entity/fighter player) target))
          (t
           (move player (car move) (cdr move))
           (fov map (entity/x player) (entity/y player)))))
  (setf (game-state/state game-state) :enemy-turn))
#+END_SRC

And the placeholder in components.lisp =take-turn=:
#+BEGIN_SRC lisp -n :hl_lines 8
(defmethod take-turn ((component basic-monster) target map entities)
  (let* ((monster (component/owner component))
         (in-sight (tile/visible (aref (game-map/tiles map) (entity/x monster) (entity/y monster)))))
    (when in-sight
      (cond ((>= (distance-to monster target) 2)
             (move-towards monster (entity/x target) (entity/y target) map entities))
            ((> (fighter/hp (entity/fighter monster)) 0)
             (attack (entity/fighter monster) target))))))
#+END_SRC

*** Conclusion
That's all there is for now. In the next post we'll be focusing on creating the
user interface so that we can display messages within the game, rather than
printing them to the REPL.

You can find the current state of the code on [[https://github.com/nwforrer/cl-rltut/tree/part-6][Github]]. The list of changes since
the previous tutorial can be found at
[[https://github.com/nwforrer/cl-rltut/compare/part-5...part-6]].

If you run into any issues, or have questions/feedback, please open an issue on this
blogs [[https://github.com/nwforrer/blog/issues][GitHub repository]].
